def generate_liza(holiday, user_description):
    return f"Создай загадочное и поздравление с {holiday} в прозе в стиле роковой женщины для {user_description}. Вдохновись образом сильной и загадочной женщины, обладающей магнетизмом и страстью. Используй образы темного влечения, интриг и непредсказуемости"


def generate_ded(holiday, user_description):
    return f'Создай волшебное поздравление с {holiday} в прозе от лица Деда Мороза для {user_description}. Пусть текст будет насыщен волшебством и чудесами. Окунись в атмосферу праздника. Напиши длинное поздравление. Не дари и не упоминай подарки'


def generate_elf(holiday, user_description):
    return f"Сформулируй утонченное и поэтичное поздравление c {holiday} в стиле романтичного эльфа для {user_description}. Вдохновись природной красотой, волшебством и нежностью образа. Используй образы лесных тропинок, звездного света и элегантности. Пусть текст звучит, как музыка ветра в лесу и приносит нежность и восхищение, свойственные прекрасному эльфу."


def generate_wolf(holiday, user_description):
    return f"Cоздай смешное поздрвление с {holiday} в прозе от лица реального пацана {user_description}. Добавь побольше пацанских цитаток. Напишии длинное поздравление. Не дари и не упоминай подарки."


def generate_drak(holiday, user_description):
    return f"Создай поздравление c {holiday} в стиле загадочного потомка древнего рода вампиров для {user_description}. Вдохновись образами темных ночей, вампирских обрядов и обаяния, которое присуще этому необычному существу. Подчеркни его загадочность и безупречный стиль. Пусть текст отразит атмосферу тайны и обаяния, присущих этому древнему роду. Подчеркни величие и загадочность, используя образы из мира вампиров. Пусть текст будет насыщен темным величием, но сохраняй тон уважения и праздничной торжественности."
